#Дана сторона квадрата a. Найти его периметр P = 4·a 

#def perimeter (a):
#    return a * 4
#a = int(input("введите сторону:"))
#perimeterResult = perimeter(a)
#print("perimeter =", perimeterResult)

#Дана сторона квадрата a. Найти его площадь{{ S = a2}}

#def square (a):
#    return a ** 2
#a = int(input("введите сторону:"))
#squareResult = square(a)
#print("square:", squareResult)

#Даны стороны прямоугольника a и b. Найти его площадь S = a·b и периметр P = 2·(a + b)

#a = int(input("введите длину"))
#b = int(input("введите ширину"))   
#S = a * b
#P = 2*(a + b)
#print("S =", S)
#print("P =", P)

#Дан диаметр окружности d. Найти ее длину{{ L = π·d, π = 3.14}}

#d = int(input("Введите диаметр окружности"))
#L = 3.14 * d
#print("Длина окружности:", L)

#Дана длина ребра куба a. Найти объем куба V = a3 и площадь его поверхности S = 6·a2

#a = int(input("введите длину ребра куба"))
#V = a ** 3
#S= 6 * a ** 2  
#print("объем куба:", V)
#print("площадь его поверхности", S)

#Даны длины ребер a, b, c прямоугольного параллелепипеда. Найти его объем V = a·b·c и площадь поверхности S = 2·(a·b + b·c + a·c)

#a = int(input("введите длину ребра прямоугольного параллелепипеда a"))
#b = int(input("введите длину ребра прямоугольного параллелепипеда b"))
#c = int(input("введите длину ребра прямоугольного параллелепипеда c"))
#V = a * b * c
#S = 2 * (a * b + b * c + a *c)
#print("объем прямоугольного параллелепипеда:", V)
#print("площадь прямоугольного параллелепипеда", S)

#Найти длину окружности L и площадь круга S заданного радиуса R: L = 2·π·R, S = π·R2, π=3.14

#R = int(input("введите радиус R"))
#L = 2 * 3.14 * R
#S = 3.14 * R ** 2
#print("длину окружности L", L)
#print("площадь круга S", S)

#Даны два числа a и b. Найти их среднее арифметическое: (a + b)/2

#a = int(input("введите число a"))
#b = int(input("введите число b"))
#average = (a + b)/2
#print("среднее арифметическое", average)

#Даны два неотрицательных числа a и b. Найти их среднее геометрическое, т. е. квадратный корень из их произведения: (a·b)1/2

#a = int(input("введите число a"))
#b = int(input("введите число b"))
#geometric =(a * b) * 0.5
#print("среднее геометрическое", geometric)

#Даны два ненулевых числа. Найти сумму, разность, произведение и частное их квадратов.

#a = int(input("введите число a"))
#b = int(input("введите число b"))

#a_two = a * a
#b_two = b *b

#sum_two = a_two + b_two
#difference_two = a_two - b_two
#composition_two = a_two * b_two
#division_two = a_two / b_two

#print("сумма двух ненулевых чисел:", sum_two)
#print("разность двух ненулевых чисел:", difference_two)
#print("произведение двух ненулевых чисел:", composition_two)
#print("частное двух ненулевых чисел:", division_two)



